ELEC5619 document

背景：
	1.真实世界的问题
	2.source，paper，媒体支持
	3.这是一个新问题

功能：
	1.12个功能，（功能+非功能）以及和问题的关联性
		功能需求：
			-创建数据（Create）：系统应允许用户或管理员添加新的记录，如创建新的用户账户或添加新的财务记录
			-读取数据（Read）：系统应允许用户或管理员查看现有的记录，例如查询账户余额或查看交易历史
			-更新数据（Update）：系统应允许用户或管理员修改现有的记录，例如更新用户的联系信息或编辑已记录的交易
			-删除数据（Delete）：系统应允许用户或管理员删除不再需要的记录，例如移除账户或删除错误的交易记录

			-用户身份认证：
			-用户权限认证：

			-用户财务信息可视化（前端）：
			-多账户管理：

			AI（核心）
			-AI理财报告：根据交易历史生成阶段性财务报告，并由AI提供理财建议，语音播报（可选），可选。

			-防诈骗小提示：根据可疑交易及历史在每一次上传新的交易历史时，在dashboard自动生成一段基于该交易历史的防诈骗小提示。
			-专业的金融AI Agent

		非功能需求：
			-高性能：使用缓存redis
			-安全性：https协议

	2.DB的ERD（小温）

	3.Mockup（宋哥）

工期：（Cory）
	1.甘特图
	2.分工（下周决定）

写作：
	1.要有cover page，页码，结构一致
	2.语法

